; 实验内容
; 一、将十进制数 82.25和 -49.75 转换成IEEE754浮点数
;	82.25=1010010.01b
;	1010010.01=1.01001001*2^6
;	S=0
;	E=6+127=133=10000101b
;	M=010 0100 1000 0000 0000 0000
;	IEEE754浮点数: 0100 0010 1010 0100 1000 0000 0000 0000b=42A48000h
;
;	49.75=110001.11b
;	S=1
;	E=5+127=10000100b
;	M=100 0111 0000 0000 0000 0000
;	IEEE754浮点数: 1100 0010 0100 0111 0000 0000 0000 0000b=C2470000h
;
; 二、将IEEE754浮点数0x4303BD71和0xC26CEB85转换成十进制数
;	4303BD71h=0100 0011 0000 0011 1011 1101 0111 0001b
;	S=0
;	E=10000110b=7+127
;	M=000 0011 1011 1101 0111 0001
;	1.000 0011 1011 1101 0111 0001*2^7=10000011.1011110101110001
;	十进制数: 131.7400054931640625
;
;	C26CEB85h=1100 0010 0110 1100 1110 1011 1000 0101b
;	S=1
;	E=10000100b=5+127
;	M=110 1100 1110 1011 1000 0101
;	-1*(1.110 1100 1110 1011 1000 0101)*2^5=-111011.001110101110000101
;	十进制数: -59.229999542236328125
;
; 三、设x=0.5,y=3.1,Qx=15,Qy=13,Qz=13, z=x+y=3.6,编写定点加法程序
; 四、设x=18.4,y=36.8,Qx=10,Qy=9,Qz=5, z=x*y=677.12,编写定点乘法程序
; 五、用SUBC指令实现除法（201/19)

	.mmregs
	.model call=c55_std
	.model mem=large

	.global	x
	.bss	x,1,0,0

	.global	y
	.bss	y,1,0,0

	.global	z
	.bss	z,1,0,0
	.sect	".text"
	.align 4
	.global	start

start:
       bclr AR0LC
       bclr ARMS
       bclr C54CM
       
;一、x=0.5,y=3.1,Qx=15,Qy=13,Qz=13, z=x+y=3.6
       mov   #2,t0

       mov   #16384,ac0                     ;x=0.5
       mov   #25395,ac1                     ;y=3.1
       add   ac1<<t0,ac0
       sftl  ac0,#-2						;ac0=加法结果

; 二、设x=18.4,y=36.8,Qx=10,Qy=9,Qz=5, z=x*y=677.12,编写定点乘法程序
       amov #010000h,XAR0

       mov   #18841,*ar0                    ;x=18.4
       mov   #18841,t1                      ;y=36.8
       mpym  *ar0,t1,ac0
       sftl  ac0,#-14                		;ac0=乘法结果

; 三、用SUBC指令实现除法
       amov #010000h,XAR0
       mov	#100,AC0                          ;被除数AC0
       mov  #7,*ar0                         ;除数  *ar0

       RPT	#15
       SUBC *AR0,AC0 						;利用循环SUBC，进行除法操作
       and #0xffff, AC0						;取低16位（商）


       ret

   
